In [1]:
import pandas as pd
import numpy as np

In [4]:
df_exam = pd.read_csv('exam_data.csv')
df_exam.head(5)

   student_id gender  age  gpax  math1  math2  sci  phy  soc  eng  chn  jpn
0       42560      m   18  3.75      1      1    1    1    0    1    0    0
1       42572      f   18  3.82      1      1    0    1    1    1    0    1
2       42553      f   18  3.90      1      0    0    0    0    1    0    0
3       42549      f   21  4.00      0      0    1    0    1    1    0    1
4       43390      m   25  1.23      1      0    0    0    1    0    0    0

**Part 1 : หาอายุเฉลี่ยของนักเรียนในสนามสอบนี้**

In [8]:
mean = df_exam['age'].mean()
mean

19.74